app/controllers/authentication_controller.rb

  def login
    if request.get?
      session[:user_id] = nil
    else
      # Try to get the user with the supplied username and password
      logged_in_user = User.login(params[:user][:name], params[:login][:password])

      # Create the session and redirect
      unless logged_in_user.blank?
---
SELECT * FROM `users` WHERE (`users`.`name` = 'public') LIMIT 1

  def create_admin
    # Check if there already is an admin
    redirect_to(:action => 'login') and return false if User.admin_exists?

    if request.post?
      # Create the object for the administrator user
      @user = User.create_admin(params[:user][:email], params[:user][:name], params[:user][:password], params[:user][:password_confirmation])

      # Create Admins group, Root folder and the permissions
      if @user.save
        Group.create_admins_group
        Folder.create_root_folder
        GroupPermission.create_initial_permissions
---
INSERT INTO `users` (`name`, `hashed_password`, `is_the_administrator`, `password_salt`, `rss_access_key`, `email`) VALUES('boombastic', 'e99eeba2f6c70414844341eebc057d46abed1975', 1, '5LSI5e', '6hhDTpN1XZhj1opWZPiOnoaAImmzEOKB54gZ', 'alex.chien@koocaa.com')
INSERT INTO `groups` (`name`, `is_the_administrators_group`) VALUES('admins', 1)
INSERT INTO `folders` (`name`, `date_modified`, `is_root`, `user_id`, `parent_id`) VALUES('Root folder', '2009-05-25 06:26:03', 1, 1, 0)
INSERT INTO `group_permissions` (`can_create`, `can_update`, `can_delete`, `folder_id`, `group_id`, `can_read`) VALUES(1, 1, 1, 1, 1, 1)