app/controllers/file_controller.rb

INSERT INTO `usages` (`myfile_id`, `download_date_time`, `user_id`) VALUES(1, '2009-05-25 12:39:38', 1)
---
  def download
    # Log the 'usage' and return the file.
    usage = Usage.new
    usage.download_date_time = Time.now
    usage.user = @logged_in_user
    usage.myfile = @myfile
    ic = Iconv.new("gbk", "utf-8")
    @change_name = ic.iconv(@myfile.filename)
    if usage.save

SELECT `myfiles`.id FROM `myfiles` WHERE (`myfiles`.`filename` = BINARY 'tweet-this-small.png' AND `myfiles`.folder_id = 2) LIMIT 1
INSERT INTO `myfiles` (`date_modified`, `folder_id`, `indexed`, `filename`, `filesize`, `user_id`) VALUES('2009-05-25 06:28:11', 2, 0, 'tweet-this-small.png', 1, 1)
---
  def do_the_upload
    @myfile = Myfile.new(params[:myfile])
    @myfile.folder_id = folder_id
    @myfile.date_modified = Time.now
    @myfile.user = @logged_in_user

    # change the filename if it already exists
    if USE_UPLOAD_PROGRESS and not Myfile.find_by_filename_and_folder_id(@myfile.filename, folder_id).blank?
      @myfile.filename = @myfile.filename + ' (' + Time.now.strftime('%Y%m%d%H%M%S') + ')'
    end

    if @myfile.save

DELETE FROM `myfiles` WHERE `id` = 1
---
  def destroy
    @myfile.destroy