app/controllers/folder_controller.rb

SELECT * FROM `folders` WHERE (`folders`.parent_id = 1) ORDER BY name, name
---
  def list
    # Get the folder
    @folder = Folder.find_by_id(folder_id)

SELECT * FROM `users` WHERE (`users`.`rss_access_key` = '6hhDTpN1XZhj1opWZPiOnoaAImmzEOKB54gZ') LIMIT 1
SELECT * FROM `folders` WHERE (`folders`.parent_id = 1) ORDER BY name, name
---
  def feed
    # check for valid access key:
    user = User.find_by_rss_access_key(params[:access_key])
    @authorized = !user.blank?

    # get the folder
    @folder = Folder.find_by_id(folder_id)

INSERT INTO `folders` (`name`, `date_modified`, `is_root`, `user_id`, `parent_id`) VALUES('media', '2009-05-25 06:27:32', 0, 1, 1)
---
  def create
    if request.post?
      @folder = Folder.new(params[:folder])
      @folder.parent_id = folder_id
      @folder.date_modified = Time.now
      @folder.user = @logged_in_user

      if @folder.save