app/controllers/group_controller.rb

  def create
    if request.post?
      @group = Group.new(params[:group])

      if @group.save
---
INSERT INTO `groups` (`name`, `is_the_administrators_group`) VALUES('test group', 0)