app/controllers/user_controller.rb

  def list
    @users = User.find(:all, :order => 'name')
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    if request.post?
      @user = User.new(params[:user])
      @user.password_required = true

      # add the user to the selected groups
      add_user_to_groups(@user, params[:belongs_to_group])

      if @user.save
---
INSERT INTO `users` (`name`, `hashed_password`, `is_the_administrator`, `password_salt`, `rss_access_key`, `email`) VALUES('public', '10be5d4ff44897d4259bc01ca30ede71ffff0b6e', 0, 'nBTosc', 'Deen7h5rHtOxV7cINO3he5LjKnZ8lAhD7Vcx', 'public@public.com')